{
  "basics": {
    "name": "Amir Masoud Nourollah",
    "image": "",
    "email": "nourollah.am@gmail.com",
    "phone": "(912) 019-7503",
    "url": "https://nourollah.me/",
    "thesis": "Using deep learning to detect neurons and segment their components in microscopy images of neurons",
    "location": {
      "address": "182 Tehranpars East St",
      "postalCode": "Ir 1655973363",
      "city": "Tehran",
      "countryCode": "IR",
      "region": "Tehran"
    },
    "profiles": []
  },
  "work": [
    {
      "NOBKA": {
        "role": "Machine Learning Researcher",
        "projects": {
          "Speech to Text": "I have used several English STT models to fine-tune them on a Persian dataset in order to enhance their accuracy.",
          "Text to Speech for Persian Language": "I have utilized several English TTS models to fine-tune them on a Persian dataset in order to facilitate this process for Iranian. Even I tried to add emotion speech generation (angry, happy, and etc) to the system in order to get new a novelty for this language.",
          "Image Steganography": "I have developed a novel method to hide information such as image, text, and etc either encrypted or raw into the image without loss with high performance action.",
          "Text Steganography": "Regarding to the monitoring system in some countries beside hackers attacks, I create a technique for completely changing the structure of the a text (it could be a word, a sentence or a paragraph) to a new thing which is completely different with the original text. It could be revert to the base form by have some hyperparameter and the algorithm and the book which have been using for transforming the text."
        }
      },
      "NOVE": {
        "role": "Machine Learning Engineer",
        "projects": {
          "Aerial Image Segmentation": "I have used several sota models to segment the aerial image accurately as much as possible.",
          "Objects Detection in Instagram Screenshots": "By using the template matching and several other image processing algorithm I developed a service to find some details about instagram screenshots.",
          "Sneeze and Cough Detection": "Although many model for voice classification have already existed, I made a highly light one to use in mobile devices to detect environment cough and sneeze.",
        }
      },
      "Faradid Payesh System": {
        "role": "Software Developer",
        "projects": {
          "Target (Navigation Cross Platform Application)": "I contributed to developing some features of this application and enhancing the network layer performance",
          "Linux Admin": "I maintained the company Linux servers for multi applications.",
          "A Multi-thread Core for a Messenger": "I developed a engine for serialize and transfer information over network using TCP protocol using C++."
        }
      }
    }
  ],
  "volunteer": [],
  "education": [
    {
      "Master of Science Student in Artificial Intelligence and Robotics": {
        "thesis": " • Thesis: Using deep learning to detect neurons and segment them either binary or semantic for their components to compute their length in fluorescence microscopy images.",
        "Teaching Assistant": "Neural Networks and Deep Learning - Digital Image Processing - Big Data and Scalable Machine Learning.",
        "GPA": "3.8/4"
      },
      "Bachelor of Science in Chemistry- Information Technology": {
        "GPA": "3.8/4"
      }
    }
  ],
  "awards": [],
  "certificates": [],
  "publications": [],
  "skills": [
    {
      "Programming Language": "Python, C++, Java",
      "Python ML Libraries, Frameworks, and Platforms": "PyTorch, Pytorch Geometric, OpenMMLab Projects, SciKit Libraries, OpenCV, Plotly, Coqui-ai TTS, RDKit",
      "Python Software Frameworks and Libraries": "Django, FastAPI, SQLModel, SQLAlchemy",
      "C++ Libraries": "Boost, libcurl",
      "OS": "Linux (Debian, Red Hat, Arch Linux), WSL, macOS",
      "Databases": "PostgreSQL, SQLite",
      "Tools": "Docker, Docker-compose, Podman, Git, Postman, CMake, MATLAB, Adobe Photoshop, ChemOffice"
    }
  ],
  "languages": [
    {
      "language": "Persian",
      "fluency": "Native speaker"
    },
    {
      "language": "Azeri",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Germany",
      "fluency": "Basic"
    }
  ],
  "interests": [
    {
      "Computer Science": "Multimodal Deep Learning(unstructured data such as vision, acoustic, and text and structured data), Reinforcement Learning, Graph Neural Networks, Multi-task Learning",
      "Chemistry": "Computational Chemistry, Energy, Semiconductors and Optimization in Molecule Synthesizing"
    }
  ],
  "references": [],
  "projects": []
}